In [2]:
import pandas as pd
from sqlalchemy import create_engine

engine=create_engine('postgresql://postgres:bleach#postgres@localhost:5433/demo')

table_query= """
SELECT table_name FROM information_schema.tables
WHERE table_schema='bookings' AND table_type='BASE TABLE'
"""

table_names=pd.read_sql(table_query,engine)['table_name'].to_list()

dfs={}
for table in table_names:
    dfs[table]=pd.read_sql(f"SELECT * FROM bookings.{table}",engine)

ticket_flights=dfs['ticket_flights']
boarding_passes=dfs['boarding_passes']
aircrafts_data=dfs['aircrafts_data']
flights=dfs['flights']
seats=dfs['seats']
tickets=dfs['tickets']
bookings=dfs['bookings']
airports_data=dfs['airports_data']

# merge
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=False,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)


| Parameter     | What it does in this example                                                                |
| ------------- | ------------------------------------------------------------------------------------------- |
| `left`        | The left DataFrame (`left`) to merge.                                                       |
| `right`       | The right DataFrame (`right`) to merge.                                                     |
| `how='outer'` | Perform an **outer join** — includes all keys from both DataFrames.                         |
| `left_on`     | Join on column `'key_left'` in the left DataFrame.                                          |
| `right_on`    | Join on column `'key_right'` in the right DataFrame.                                        |
| `left_index`  | Don’t use left index for join keys (False).                                                 |
| `right_index` | Don’t use right index for join keys (False).                                                |
| `sort=True`   | Sort the result by join keys (`key_left` and `key_right`).                                  |
| `suffixes`    | Add suffixes `_left` and `_right` to overlapping columns (`id`, `value`).                   |
| `copy=True`   | Copy data from inputs to result DataFrame.                                                  |
| `indicator`   | Adds a `_merge` column indicating join source — `'left_only'`, `'right_only'`, or `'both'`. |
| `validate`    | Checks that merge is `one_to_one` (each key appears once in both).                          |

### no overlapping columns in the tables so no suffixes needed

# INNER JOIN

In [3]:
pd.merge(boarding_passes,seats,on='seat_no',how='inner',left_index=False,right_index=False,sort=True,copy=True,suffixes=(None,'_s'),validate='many_to_many',indicator=False).groupby(by='fare_conditions',level=None,observed=False,dropna=True,group_keys=True,as_index=True,sort=True).size()

fare_conditions
Business     621092
Comfort      112098
Economy     2476771
dtype: int64

# FULL OUTER JOIN

In [4]:
updated_tickets=tickets.rename(columns={'ticket_no':'ticket_no_1'})
t1 = pd.merge(updated_tickets, boarding_passes, left_on='ticket_no_1',right_on='ticket_no',how='outer', sort=True, validate='many_to_many', left_index=False, right_index=False, suffixes=('_t', '_bp'), indicator=False)
t1.loc[t1['ticket_no'].isna()].shape[0]

127899

# LEFT JOIN

In [14]:
updated_seats=seats.rename(columns={'seat_no':'seat_no_1'})
t2=pd.merge(updated_seats,boarding_passes,left_on='seat_no_1',right_on='seat_no',how='left',sort=True,copy=True,validate='many_to_many',indicator=False,left_index=False,right_index=False,suffixes=(None,None))
t2[['seat_no_1','seat_no']]=t2[['seat_no_1','seat_no']].apply(func= lambda x:x.str[-1])
t2.groupby(by='seat_no_1',level=None,observed=False,as_index=True,group_keys=True,sort=True,dropna=True).size().reset_index(name='count').sort_values(by='count',ascending=False,ignore_index=True,inplace=False,kind='mergesort',key=None,na_position='last')

  seat_no_1   count
0         A  751618
1         D  652188
2         C  596921
3         F  467493
4         E  377687
5         B  280289
6         H   34574
7         G   34552
8         K    9000
9         J    5639

| Step   | Topic                           | Command / Syntax                                                                                                                       | Notes                                                        |
| ------ | ------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------ |
| **1**  | **Create Database**             | `CREATE DATABASE mydb;`                                                                                                                | Must connect to DB before making tables.                     |
| **2**  | **Create Table (basic)**        | `sql CREATE TABLE table_name ( col_name data_type constraints, ... ); `                                                                | Columns + optional constraints (`NOT NULL`, `UNIQUE`, etc.). |
| **3**  | **Data Types (common)**         | `INT`, `SERIAL`, `VARCHAR(n)`, `NUMERIC(p,s)`, `DATE`, `BOOLEAN`                                                                       | `SERIAL` = auto-increment integer.                           |
| **4**  | **Basic Constraints**           | `PRIMARY KEY`, `NOT NULL`, `UNIQUE`, `CHECK`, `DEFAULT`                                                                                | Enforces data rules.                                         |
| **5**  | **Foreign Key Basics**          | Inline: `dept_id INT REFERENCES departments(dept_id)`<br>Table-level: `FOREIGN KEY (dept_id) REFERENCES departments(dept_id)`          | **Parent table must exist first** before adding FK.          |
| **6**  | **Foreign Key Cascade Options** | `ON DELETE CASCADE`, `ON UPDATE CASCADE`, `RESTRICT`, `SET NULL`, `SET DEFAULT`                                                        | Controls behavior on parent change.                          |
| **7**  | **Order of FK Creation**        | 1. Create **parent** table.<br>2. Create **child** table.<br>3. Or create later with `ALTER TABLE ... ADD CONSTRAINT ... FOREIGN KEY`. |                                                              |
| **8**  | **Insert Data**                 | `sql INSERT INTO table_name (col1, col2) VALUES (val1, val2); `                                                                        | Column list optional if inserting all fields.                |
| **9**  | **Select Data**                 | `SELECT * FROM table_name;`                                                                                                            | Add `WHERE`, `ORDER BY`, `LIMIT` for filtering.              |
| **10** | **Update Data**                 | `UPDATE table_name SET col = val WHERE condition;`                                                                                     | Without `WHERE`, updates all rows!                           |
| **11** | **Delete Data**                 | `DELETE FROM table_name WHERE condition;`                                                                                              | Without `WHERE`, deletes all rows.                           |
| **12** | **View Tables**                 | `\dt` (psql)                                                                                                                           | Lists all tables in DB.                                      |
| **13** | **Describe Table**              | `\d table_name`                                                                                                                        | Shows columns, types, constraints.                           |
| **14** | **Add Column**                  | `ALTER TABLE table_name ADD COLUMN col_name type;`                                                                                     |                                                              |
| **15** | **Rename Column**               | `ALTER TABLE table_name RENAME COLUMN old TO new;`                                                                                     |                                                              |
| **16** | **Change Column Type**          | `ALTER TABLE table_name ALTER COLUMN col_name TYPE new_type;`                                                                          | May require data cast.                                       |
| **17** | **Set / Drop Default**          | `ALTER TABLE table_name ALTER COLUMN col_name SET DEFAULT val;`<br>`ALTER TABLE table_name ALTER COLUMN col_name DROP DEFAULT;`        |                                                              |
| **18** | **Set / Drop NOT NULL**         | `ALTER TABLE table_name ALTER COLUMN col_name SET NOT NULL;`<br>`ALTER TABLE table_name ALTER COLUMN col_name DROP NOT NULL;`          |                                                              |
| **19** | **Drop Column**                 | `ALTER TABLE table_name DROP COLUMN col_name;`                                                                                         |                                                              |
| **20** | **Rename Table**                | `ALTER TABLE old_name RENAME TO new_name;`                                                                                             |                                                              |
| **21** | **Truncate Table**              | `TRUNCATE TABLE table_name;`                                                                                                           | Deletes all rows, keeps structure.                           |
| **22** | **Drop Table**                  | `DROP TABLE table_name;`                                                                                                               | Removes table completely.                                    |
| **23** | **Drop Constraint**             | `ALTER TABLE table_name DROP CONSTRAINT constraint_name;`                                                                              | Needed before changing most constraints.                     |
| **24** | **Add Constraint**              | `sql ALTER TABLE table_name ADD CONSTRAINT name FOREIGN KEY (col) REFERENCES parent(col) ON DELETE CASCADE; `                          | Works for FK, UNIQUE, CHECK.                                 |
| **25** | **Find Constraints**            | `sql SELECT conname, contype FROM pg_constraint WHERE conrelid = 'table_name'::regclass; `                                             | `p`=PK, `f`=FK, `u`=Unique, `c`=Check.                       |
| **26** | **Indexing**                    | `CREATE INDEX idx_name ON table_name(col);`                                                                                            | Speeds up searches.                                          |
| **27** | **Permissions**                 | `GRANT SELECT, INSERT ON table_name TO user;`<br>`REVOKE DELETE ON table_name FROM user;`                                              | Controls access.                                             |
| **28** | **Transactions**                | `BEGIN; ... COMMIT;` or `ROLLBACK;`                                                                                                    | Groups multiple commands into one unit.                      |